Ham0osh/PSoC-Programs/test_projects/Proj06_freefly_hamflyAPI_integration.cydsn/main.c
/* main.c
 * Author: Hamish Johnson
 * Org: Quantum Internet Systems Lab, SFU, Physics
 * Date: March 2026
 *
 * Uses HamflyAPI (hamfly.h) for all gimbal communication.
 *
 * Modes:
 *   STANDBY      passive, pump runs, 1Hz status if valid
 *   CONTROL      QX277 at 10Hz, joystick or presets
 *   TEST         one-shot attr read, verbose print or timeout
 *   SCAN         exhaustive attr sweep
 *   RESET        attr 382 heading reset sequence
 *   SENSOR       continuous compact sensor stream
 *
 * Keys — STANDBY:
 *   m  toggle STANDBY <-> CONTROL
 *   t  enter TEST      w  enter SCAN
 *   r  enter RESET     v  enter SENSOR
 *   j  toggle joystick l  cycle DEFER/RATE/ABS
 *   k  kill + STANDBY  x  kill + quiet
 *   s  toggle ADC stream  c  calibration
 *
 * Keys — CONTROL (plus all STANDBY keys):
 *   f  attr 48 one-shot  p  platform yaw toggle
 *   0  home  1  pan+45   2  pan-45
 *   3  tilt+30  4  tilt-30  5  pan+90
 *
 * Keys — TEST:
 *   a  attr 22 euler    g  attr 4 GPS
 *   b  attr 3 baro      s  attr 1 sysstat
 *   n  attr 12 mag      2  attr 2 platform att
 *   4  attr 48 motor    q  quat crosscheck
 *   t  exit             k/x  kill + exit
 *
 * Keys — RESET:  x/k abort
 * Keys — SENSOR: any key exits
 */

#include <project.h>
#include <stdio.h>
#include <math.h>
#include <string.h>

#include "hamfly.h"
#include "adc_balanced.h"
#include "joystick.h"
#include "psoc_eeprom.h"

/* =========================================================================
 * Constants
 * ========================================================================= */
#define TX_BUF_SIZE       160u
#define CONTROL_PERIOD_MS 100u
#define DIAG_PERIOD_MS    1000u
#define TEST_TIMEOUT_MS   2000u
#define SCAN_TIMEOUT_MS    500u
#define SCAN_BATCH_SIZE    200u
#define SCAN_ATTR_MIN      801u
#define SCAN_ATTR_MAX     2400u
#define SCAN_TX_BUF_SIZE   16u
#define RESET_POLL_MS     1000u
#define RESET_TIMEOUT_MS 15000u
#define SENSOR_POLL_MS     600u
#define SENSOR_TIMEOUT_MS 1500u
#define SENSOR_N_ATTRS      4u

#define DEG_TO_UNIT(d)  ((float)(d) / 180.0f)
#define FALSE  0u
#define TRUE   1u
#define CH_X   0u
#define CH_Y   1u

/* =========================================================================
 * App state
 * ========================================================================= */
typedef enum {
    APP_MODE_STANDBY = 0,
    APP_MODE_CONTROL,
    APP_MODE_TEST,
    APP_MODE_SCAN,
    APP_MODE_RESET,
    APP_MODE_SENSOR
} app_mode_t;

/* =========================================================================
 * Globals
 * ========================================================================= */
static hamfly_gimbal_t g_movi;
volatile uint32_t      g_tick_ms = 0u;

/* =========================================================================
 * HAL
 * ========================================================================= */
static void psoc_uart_putc(void *ctx, uint8_t b)
{
    (void)ctx;
    UART_MOVI_PutChar((char)b);
}

static uint32_t psoc_get_tick(void *ctx)
{
    (void)ctx;
    return g_tick_ms;
}

static const hamfly_hal_t MOVI_HAL = {
    .ctx         = NULL,
    .uart_putc   = psoc_uart_putc,
    .get_tick_ms = psoc_get_tick
};

/* =========================================================================
 * ISRs
 * ========================================================================= */
CY_ISR(isr_rx_movi_Handler)
{
    uint8_t st;
    do {
        st = UART_MOVI_RXSTATUS_REG;
        if (st & (UART_MOVI_RX_STS_BREAK     |
                  UART_MOVI_RX_STS_PAR_ERROR |
                  UART_MOVI_RX_STS_STOP_ERROR|
                  UART_MOVI_RX_STS_OVERRUN))
            hamfly_on_uart_err_flags(&g_movi, st);
        if (st & UART_MOVI_RX_STS_FIFO_NOTEMPTY)
            hamfly_on_rx_byte(&g_movi, UART_MOVI_RXDATA_REG);
    } while (st & UART_MOVI_RX_STS_FIFO_NOTEMPTY);
}

CY_ISR(isr_Looptimer_Handler)
{
    g_tick_ms++;
    Looptimer_ReadStatusRegister();
}

/* =========================================================================
 * Helpers
 * ========================================================================= */
static void decomp(float val, int16_t *i_out, int16_t *f_out, char *sign)
{
    *sign  = (val < 0.0f) ? '-' : ' ';
    if (val < 0.0f) val = -val;
    *i_out = (int16_t)val;
    *f_out = (int16_t)((val - (float)*i_out) * 100.0f);
    if (*f_out < 0) *f_out = -*f_out;
}

static void compute_euler(const hamfly_telemetry_t *st,
    char *pan_s,  int16_t *pan_i,  int16_t *pan_f,
    char *tilt_s, int16_t *tilt_i, int16_t *tilt_f,
    char *roll_s, int16_t *roll_i, int16_t *roll_f)
{
    float r  = st->gimbal_r, ii = st->gimbal_i;
    float j  = st->gimbal_j, k  = st->gimbal_k;
    float sinr = 2.0f*(r*ii+j*k), cosr = 1.0f-2.0f*(ii*ii+j*j);
    float roll_deg = atan2f(sinr, cosr) * 57.2958f;
    float sinp = 2.0f*(r*j-k*ii);
    float tilt_deg = (sinp >= 1.0f) ?  90.0f :
                     (sinp <=-1.0f) ? -90.0f :
                     asinf(sinp) * 57.2958f;
    float siny = 2.0f*(r*k+ii*j), cosy = 1.0f-2.0f*(j*j+k*k);
    float pan_deg = atan2f(siny, cosy) * 57.2958f;
    decomp(pan_deg,  pan_i,  pan_f,  pan_s);
    decomp(tilt_deg, tilt_i, tilt_f, tilt_s);
    decomp(roll_deg, roll_i, roll_f, roll_s);
}

static const char *mode_str(hamfly_control_mode_t m)
{
    switch (m) {
        case HAMFLY_RATE:     return "RATE";
        case HAMFLY_ABSOLUTE: return "ABS ";
        default:              return "DEFR";
    }
}

static void print_hex_dump(const uint8_t *p, uint8_t plen)
{
    char buf[TX_BUF_SIZE];
    uint8_t row, col;
    for (row = 0u; row < plen; row += 8u) {
        char *bp = buf;
        bp += sprintf(bp, "  off%02u:", (unsigned)row);
        for (col = 0u; col < 8u && (row+col) < plen; col++)
            bp += sprintf(bp, " %02X", (unsigned)p[row+col]);
        bp += sprintf(bp, "\r\n");
        UART_DEBUG_PutString(buf);
    }
}

/* =========================================================================
 * Snapshot macros
 * ========================================================================= */
#define SNAP16(p,plen,off) \
    (((off)+2u<=(plen))?({int16_t _v;memcpy(&_v,(p)+(off),2);_v;}):(int16_t)0)
#define SNAP16BE(p,plen,off) \
    (((off)+2u<=(plen)) \
        ?(int16_t)(((uint16_t)(p)[(off)]<<8)|(uint16_t)(p)[(off)+1u]) \
        :(int16_t)0)
#define SNAP32BE(p,plen,off) \
    (((off)+4u<=(plen)) \
        ?(int32_t)(((uint32_t)(p)[(off)]<<24)|((uint32_t)(p)[(off)+1u]<<16) \
                  |((uint32_t)(p)[(off)+2u]<<8)|(uint32_t)(p)[(off)+3u]) \
        :(int32_t)0)

/* =========================================================================
 * Test verbose printers
 * ========================================================================= */
static void print_att(const uint8_t *p, uint8_t plen, uint32_t dt)
{
    char buf[TX_BUF_SIZE];
    sprintf(buf, "\r\n[TEST][Att] dt=%lums snaplen=%u\r\n",
            (unsigned long)dt, plen);
    UART_DEBUG_PutString(buf);
    print_hex_dump(p, plen);
    if (plen < 6u) { UART_DEBUG_PutString("  short\r\n"); return; }
    char s; int16_t vi, vf;
    int16_t r1=SNAP16(p,plen,1), r3=SNAP16(p,plen,3), r5=SNAP16(p,plen,5);
    decomp((float)r1/100.0f, &vi, &vf, &s);
    sprintf(buf,"  off1 /100 %6d => %c%d.%02d [PITCH]\r\n",(int)r1,s,vi,vf);
    UART_DEBUG_PutString(buf);
    decomp((float)r3/100.0f, &vi, &vf, &s);
    sprintf(buf,"  off3 /100 %6d => %c%d.%02d [YAW]\r\n",(int)r3,s,vi,vf);
    UART_DEBUG_PutString(buf);
    decomp((float)r5/100.0f, &vi, &vf, &s);
    sprintf(buf,"  off5 /100 %6d => %c%d.%02d [ROLL]\r\n",(int)r5,s,vi,vf);
    UART_DEBUG_PutString(buf);
}

static void print_gps(const uint8_t *p, uint8_t plen, uint32_t dt)
{
    char buf[TX_BUF_SIZE];
    sprintf(buf, "\r\n[TEST][GPS] dt=%lums snaplen=%u\r\n",
            (unsigned long)dt, plen);
    UART_DEBUG_PutString(buf);
    print_hex_dump(p, plen);
    if (plen < 12u) { UART_DEBUG_PutString("  short\r\n"); return; }
    int32_t lon=SNAP32BE(p,plen,0), lat=SNAP32BE(p,plen,4);
    int32_t alt=SNAP32BE(p,plen,8);
    sprintf(buf,"  Lat=%ld.%07ld Lon=%ld.%07ld Alt=%ld mm\r\n",
            (long)(lat/10000000L),(long)(lat%10000000L),
            (long)(lon/10000000L),(long)(lon%10000000L),(long)alt);
    UART_DEBUG_PutString(buf);
}

static void print_baro(const uint8_t *p, uint8_t plen, uint32_t dt)
{
    char buf[TX_BUF_SIZE];
    sprintf(buf, "\r\n[TEST][Baro] dt=%lums snaplen=%u\r\n",
            (unsigned long)dt, plen);
    UART_DEBUG_PutString(buf);
    print_hex_dump(p, plen);
    if (plen < 5u) { UART_DEBUG_PutString("  short\r\n"); return; }
    char s; int16_t vi, vf;
    int16_t alt=SNAP16(p,plen,1), roc=SNAP16(p,plen,3);
    decomp((float)alt/10.0f, &vi, &vf, &s);
    sprintf(buf,"  Alt=%c%d.%02d m  ", s, vi, vf); UART_DEBUG_PutString(buf);
    decomp((float)roc/100.0f, &vi, &vf, &s);
    sprintf(buf,"ROC=%c%d.%02d m/s\r\n", s, vi, vf); UART_DEBUG_PutString(buf);
}

static void print_sysstat(const uint8_t *p, uint8_t plen, uint32_t dt)
{
    char buf[TX_BUF_SIZE];
    sprintf(buf, "\r\n[TEST][Stat] dt=%lums snaplen=%u\r\n",
            (unsigned long)dt, plen);
    UART_DEBUG_PutString(buf);
    print_hex_dump(p, plen);
    if (plen < 4u) { UART_DEBUG_PutString("  short\r\n"); return; }
    char s; int16_t vi, vf;
    int16_t bv = SNAP16BE(p,plen,0);
    decomp((float)bv/100.0f, &vi, &vf, &s);
    sprintf(buf,"  Batt=%c%d.%02d V  Sats=%u  Temp=%d C\r\n",
            s, vi, vf, p[2], p[3]/3u);
    UART_DEBUG_PutString(buf);
    if (plen >= 11u) {
        int16_t pres = SNAP16BE(p,plen,9);
        decomp((float)pres/10.0f, &vi, &vf, &s);
        sprintf(buf,"  Pres=%c%d.%02d mb\r\n", s, vi, vf);
        UART_DEBUG_PutString(buf);
    }
}

static void print_mag(const uint8_t *p, uint8_t plen, uint32_t dt)
{
    char buf[TX_BUF_SIZE];
    sprintf(buf, "\r\n[TEST][Mag] dt=%lums snaplen=%u\r\n",
            (unsigned long)dt, plen);
    UART_DEBUG_PutString(buf);
    print_hex_dump(p, plen);
    if (plen < 6u) { UART_DEBUG_PutString("  short\r\n"); return; }
    int16_t x=SNAP16BE(p,plen,0), y=SNAP16BE(p,plen,2), z=SNAP16BE(p,plen,4);
    float hdg = atan2f((float)y,(float)x)*57.2958f;
    if (hdg < 0.0f) hdg += 360.0f;
    char s; int16_t hi, hf;
    decomp(hdg, &hi, &hf, &s);
    sprintf(buf,"  X=%d Y=%d Z=%d  hdg~=%d.%02d deg\r\n",
            (int)x,(int)y,(int)z,(int)hi,(int)hf);
    UART_DEBUG_PutString(buf);
}

static void print_platform(const uint8_t *p, uint8_t plen, uint32_t dt)
{
    char buf[TX_BUF_SIZE];
    sprintf(buf, "\r\n[TEST][Plat] dt=%lums snaplen=%u\r\n",
            (unsigned long)dt, plen);
    UART_DEBUG_PutString(buf);
    print_hex_dump(p, plen);
    if (plen < 7u) { UART_DEBUG_PutString("  short\r\n"); return; }
    char s; int16_t vi, vf;
    int16_t roll =SNAP16BE(p,plen,1);
    int16_t pitch=SNAP16BE(p,plen,3);
    int16_t yaw  =SNAP16BE(p,plen,5);
    decomp((float)roll /100.0f,&vi,&vf,&s);
    sprintf(buf,"  Roll =%c%d.%02d  ",s,vi,vf); UART_DEBUG_PutString(buf);
    decomp((float)pitch/100.0f,&vi,&vf,&s);
    sprintf(buf,"Pitch=%c%d.%02d  ",s,vi,vf); UART_DEBUG_PutString(buf);
    decomp((float)yaw  /100.0f,&vi,&vf,&s);
    sprintf(buf,"Yaw=%c%d.%02d deg\r\n",s,vi,vf); UART_DEBUG_PutString(buf);
    UART_DEBUG_PutString("  (GCU box, not camera)\r\n");
}

static void print_motor(const uint8_t *p, uint8_t plen, uint32_t dt)
{
    char buf[TX_BUF_SIZE];
    sprintf(buf, "\r\n[TEST][Drv] dt=%lums snaplen=%u\r\n",
            (unsigned long)dt, plen);
    UART_DEBUG_PutString(buf);
    print_hex_dump(p, plen);
    if (plen < 9u) { UART_DEBUG_PutString("  short\r\n"); return; }
    sprintf(buf,"  off8=0x%02X (device flag)\r\n",(unsigned)p[8]);
    UART_DEBUG_PutString(buf);
    if (plen >= 14u) {
        uint8_t any = 0u, i;
        for (i=9u;i<=13u;i++) if(p[i]) { any=1u; break; }
        sprintf(buf,"  off9-13: %02X %02X %02X %02X %02X  %s\r\n",
                p[9],p[10],p[11],p[12],p[13],
                any ? "non-zero: active" : "all zero: idle");
        UART_DEBUG_PutString(buf);
    }
}

static void print_test_response(uint32_t dt)
{
    uint16_t attr = g_movi.pending_response_attr;
    const uint8_t *p = g_movi.pending_payload;
    uint8_t plen = g_movi.pending_payload_len;
    switch (attr) {
        case 22u: print_att(p, plen, dt);      break;
        case  4u: print_gps(p, plen, dt);      break;
        case  3u: print_baro(p, plen, dt);     break;
        case  1u: print_sysstat(p, plen, dt);  break;
        case 12u: print_mag(p, plen, dt);      break;
        case  2u: print_platform(p, plen, dt); break;
        case 48u: print_motor(p, plen, dt);    break;
        default: {
            char buf[64];
            sprintf(buf, "[TEST] attr=%u -- no printer\r\n", (unsigned)attr);
            UART_DEBUG_PutString(buf);
        }
    }
}

/* =========================================================================
 * Sensor mode compact printers
 * ========================================================================= */
static void print_sensor_response(void)
{
    uint16_t attr = g_movi.pending_response_attr;
    const uint8_t *p = g_movi.pending_payload;
    uint8_t plen = g_movi.pending_payload_len;
    char buf[TX_BUF_SIZE];
    char s; int16_t vi, vf;

