Ham0osh/PSoC-Programs/test_projects/Proj06_freefly_hamflyAPI_integration.cydsn/main.c
    switch (attr) {
        case 12u: {
            if (plen < 6u) { UART_DEBUG_PutString("[MAG] short\r\n"); break; }
            int16_t x=SNAP16BE(p,plen,0);
            int16_t y=SNAP16BE(p,plen,2);
            int16_t z=SNAP16BE(p,plen,4);
            float hdg=atan2f((float)y,(float)x)*57.2958f;
            if (hdg<0.0f) hdg+=360.0f;
            decomp(hdg,&vi,&vf,&s);
            sprintf(buf,"[MAG] X=%6d Y=%6d Z=%6d hdg~=%d.%02d deg\r\n",
                    (int)x,(int)y,(int)z,(int)vi,(int)vf);
            UART_DEBUG_PutString(buf);
            break;
        }
        case 3u: {
            if (plen < 5u) { UART_DEBUG_PutString("[BARO] short\r\n"); break; }
            int16_t alt=SNAP16(p,plen,1), roc=SNAP16(p,plen,3);
            decomp((float)alt/10.0f,&vi,&vf,&s);
            sprintf(buf,"[BARO] alt=%c%d.%02d m  ",s,vi,vf);
            UART_DEBUG_PutString(buf);
            decomp((float)roc/100.0f,&vi,&vf,&s);
            sprintf(buf,"roc=%c%d.%02d m/s\r\n",s,vi,vf);
            UART_DEBUG_PutString(buf);
            break;
        }
        case 1u: {
            if (plen < 4u) { UART_DEBUG_PutString("[STAT] short\r\n"); break; }
            int16_t bv=SNAP16BE(p,plen,0);
            decomp((float)bv/100.0f,&vi,&vf,&s);
            sprintf(buf,"[STAT] batt=%c%d.%02d V  sats=%u  temp=%d C\r\n",
                    s,vi,vf,p[2],p[3]/3u);
            UART_DEBUG_PutString(buf);
            break;
        }
        case 2u: {
            if (plen < 7u) { UART_DEBUG_PutString("[PLAT] short\r\n"); break; }
            int16_t yaw=SNAP16BE(p,plen,5);
            decomp((float)yaw/100.0f,&vi,&vf,&s);
            sprintf(buf,"[PLAT] yaw=%c%d.%02d deg\r\n",s,vi,vf);
            UART_DEBUG_PutString(buf);
            break;
        }
        default: break;
    }
}

/* =========================================================================
 * Kill helper
 * ========================================================================= */
static void do_kill(app_mode_t *mode, uint8_t *joy_active,
                    uint8_t *streaming, hamfly_control_mode_t *ctrl_mode)
{
    if (*mode == APP_MODE_CONTROL) {
        hamfly_kill(&g_movi);
        UART_DEBUG_PutString("[CLI] Kill sent\r\n");
    }
    *joy_active = FALSE;
    *mode       = APP_MODE_STANDBY;
    *streaming  = FALSE;
    *ctrl_mode  = HAMFLY_DEFER;
    joystick_on_key('x');
    UART_DEBUG_PutString("[CLI] Stopped -> STANDBY\r\n");
}

/* =========================================================================
 * Quat crosscheck helper
 * ========================================================================= */
static void print_quat_crosscheck(void)
{
    char buf[TX_BUF_SIZE];
    hamfly_telemetry_t st;
    hamfly_get_telemetry(&g_movi, &st);

    UART_DEBUG_PutString("\r\n[TEST3] Quat vs Euler crosscheck\r\n");
    if (!st.valid) {
        UART_DEBUG_PutString("[TEST3] No valid 287 yet -- enter CONTROL first\r\n");
        return;
    }
    char ps, ts, rs;
    int16_t pi, pf, ti, tf, ri, rf;
    compute_euler(&st, &ps,&pi,&pf, &ts,&ti,&tf, &rs,&ri,&rf);
    sprintf(buf,"  Q->Euler: Pan=%c%d.%02d Tilt=%c%d.%02d Roll=%c%d.%02d\r\n",
            ps,pi,pf, ts,ti,tf, rs,ri,rf);
    UART_DEBUG_PutString(buf);
    sprintf(buf,"  Raw: R=%.4f I=%.4f J=%.4f K=%.4f\r\n",
            st.gimbal_r, st.gimbal_i, st.gimbal_j, st.gimbal_k);
    UART_DEBUG_PutString(buf);
    UART_DEBUG_PutString("[TEST3] Requesting attr 22 for direct Euler...\r\n");
    hamfly_request_attr(&g_movi, 22u);
    g_movi.pending_sent_ms = g_tick_ms;
}

/* =========================================================================
 * Calibration prompt helper
 * ========================================================================= */
static void cal_prompt(joy_cal_state_t prev, joy_cal_state_t now)
{
    if (prev == now) return;
    if (now == JOY_CAL_RANGE_CAPTURE)
        UART_DEBUG_PutString("\r\n[CAL] Move joystick full range then press 'c'\r\n");
    else if (now == JOY_CAL_CENTER_CAPTURE)
        UART_DEBUG_PutString("\r\n[CAL] Hold center...\r\n");
    else if (now == JOY_CAL_CONFIRM_SAVE)
        UART_DEBUG_PutString("\r\n[CAL] Press 'c' to save, 'x' to cancel\r\n");
    else if (now == JOY_CAL_OFF && prev == JOY_CAL_CONFIRM_SAVE) {
        if (joystick_save())
            UART_DEBUG_PutString("[CAL] Saved to EEPROM\r\n");
        else
            UART_DEBUG_PutString("[CAL] EEPROM save FAILED\r\n");
            char dbuf[64];
            sprintf(dbuf, "[CAL] sizeof(joy_cal_t)=%u\r\n",
                    (unsigned)sizeof(joy_cal_t));
            UART_DEBUG_PutString(dbuf);
    }
    else if (now == JOY_CAL_OFF && prev != JOY_CAL_OFF)
        UART_DEBUG_PutString("[CAL] Cancelled\r\n");
}

/* =========================================================================
 * main
 * ========================================================================= */
int main(void)
{
    char tx[TX_BUF_SIZE];

    app_mode_t            app_mode   = APP_MODE_STANDBY;
    hamfly_control_mode_t ctrl_mode  = HAMFLY_DEFER;
    hamfly_control_t      ctl;

    uint8_t joystick_active   = FALSE;
    uint8_t streaming_adc     = FALSE;
    uint8_t diag_active       = FALSE;
    uint8_t show_platform_yaw = FALSE;
    uint8_t ctrl_attr_pending = 0u;

    float abs_pan_target    = 0.0f;
    float abs_tilt_target   = 0.0f;
    uint8_t abs_preset_active = FALSE;

    uint32_t last_tx_ms   = 0u;
    uint32_t last_diag_ms = 0u;

    /* RESET state */
    typedef enum {
        RESET_IDLE=0, RESET_SENT, RESET_ACTIVE, RESET_DONE
    } reset_state_t;
    reset_state_t reset_state   = RESET_IDLE;
    uint32_t      reset_poll_ms = 0u;
    uint32_t      reset_start_ms = 0u;
    uint8_t       reset_saw_01  = FALSE;

    /* SENSOR state */
    static const uint16_t sensor_attrs[SENSOR_N_ATTRS] = {12u,3u,1u,2u};
    uint8_t  sensor_idx        = 0u;
    uint32_t sensor_sent_ms    = 0u;
    uint8_t  sensor_tx_pending = FALSE;

    /* SCAN state */
    uint16_t scan_next_attr    = SCAN_ATTR_MIN;
    uint16_t scan_batch_start  = SCAN_ATTR_MIN;
    uint8_t  scan_waiting      = FALSE;
    uint8_t  scan_tx_pending   = FALSE;
    uint32_t scan_sent_ms      = 0u;
    uint8_t  scan_tx_buf[SCAN_TX_BUF_SIZE];
    uint8_t  scan_tx_len       = 0u;

    int16_t   counts[N_CH];
    joy_cmd_t cmd;
    cmd.u[0] = cmd.u[1] = 0.0f;

    joy_cal_t defaults;
    uint8_t i;
    for (i=0u; i<(uint8_t)N_CH; i++) {
        defaults.minv[i]=0; defaults.maxv[i]=255; defaults.center[i]=128;
    }
    defaults.valid = 0u;

    joy_cal_state_t cal_prev = JOY_CAL_OFF;
    joy_sensitivity_t current_sense = SENSE_MED;
    uint8_t last_button = 1u;
    uint32_t invert_mask = (1u << CH_X);

    /* ------------------------------------------------------------------
     * Hardware init
     * ------------------------------------------------------------------ */
    CyGlobalIntEnable;

