Ham0osh/PSoC-Programs/test_projects/Proj06_freefly_hamflyAPI_integration.cydsn/main.c
    UART_DEBUG_Start();
    UART_DEBUG_PutString("\r\n=== HamflyAPI  PSoC 5LP ===\r\n");
    UART_DEBUG_PutString("STANDBY: m=ctrl t=test w=scan r=reset v=sensor\r\n");
    UART_DEBUG_PutString("         j=joy l=mode s=adc c=cal k=kill x=quiet\r\n");
    UART_DEBUG_PutString("CONTROL: f=attr48 p=plat-yaw 0-5=presets\r\n");
    UART_DEBUG_PutString("TEST:    a=att g=GPS b=baro s=stat n=mag\r\n");
    UART_DEBUG_PutString("         2=plat 4=motor q=quat t=exit\r\n");

    UART_MOVI_Start();
    UART_MOVI_ClearRxBuffer();
    UART_MOVI_ClearTxBuffer();

    hamfly_init(&g_movi, &MOVI_HAL);
    isr_rx_movi_StartEx(isr_rx_movi_Handler);
    UART_DEBUG_PutString("[Init] Gimbal UART ready\r\n");
    psoc_eeprom_init();
    if (!joystick_load(invert_mask)) {
        UART_DEBUG_PutString("[Init] No saved cal -- using defaults\r\n");
        joystick_init(&defaults, invert_mask);
    } else {
        UART_DEBUG_PutString("[Init] Loaded cal from EEPROM\r\n");
    }
    adc_balanced_init();
    UART_DEBUG_PutString("[Init] ADC + Joystick ready\r\n");

    Looptimer_Start();
    isr_Looptimer_StartEx(isr_Looptimer_Handler);
    UART_DEBUG_PutString("[Init] Ready  Mode: STANDBY\r\n");

    /* ------------------------------------------------------------------
     * Main loop
     * ------------------------------------------------------------------ */
    for (;;)
    {
        /* ----------------------------------------------------------------
         * CLI
         * ---------------------------------------------------------------- */
        uint8_t ch = (uint8_t)UART_DEBUG_GetChar();

        /* --- STANDBY / CONTROL shared keys --- */
        if (app_mode == APP_MODE_STANDBY ||
            app_mode == APP_MODE_CONTROL)
        {
            if (ch == 'm' || ch == 'M') {
                if (app_mode == APP_MODE_STANDBY) {
                    app_mode = APP_MODE_CONTROL;
                    diag_active = TRUE;
                    abs_preset_active = FALSE;
                    UART_DEBUG_PutString("[CLI] -> CONTROL\r\n");
                } else {
                    app_mode = APP_MODE_STANDBY;
                    UART_DEBUG_PutString("[CLI] -> STANDBY\r\n");
                }
            }
            else if ((ch=='t'||ch=='T') && app_mode==APP_MODE_STANDBY) {
                app_mode = APP_MODE_TEST;
                UART_DEBUG_PutString("[CLI] -> TEST\r\n");
            }
            else if ((ch=='r'||ch=='R') && app_mode==APP_MODE_STANDBY) {
                app_mode       = APP_MODE_RESET;
                reset_state    = RESET_SENT;
                reset_saw_01   = FALSE;
                reset_start_ms = g_tick_ms;
                reset_poll_ms  = g_tick_ms;
                UART_DEBUG_PutString("[RESET] Writing attr 382=0x01\r\n");
                hamfly_write_attr_u8(&g_movi, 382u, 0x01u);
                hamfly_request_attr(&g_movi, 382u);
                g_movi.pending_sent_ms = g_tick_ms;
            }
            else if ((ch=='v'||ch=='V') && app_mode==APP_MODE_STANDBY) {
                app_mode = APP_MODE_SENSOR;
                sensor_idx = 0u; sensor_tx_pending = FALSE;
                UART_DEBUG_PutString("[SENSOR] MAG BARO STAT PLAT -- any key exits\r\n");
            }
            else if ((ch=='w'||ch=='W') && app_mode==APP_MODE_STANDBY) {
                app_mode = APP_MODE_SCAN;
                scan_next_attr = SCAN_ATTR_MIN;
                scan_batch_start = SCAN_ATTR_MIN;
                scan_waiting = FALSE; scan_tx_pending = FALSE;
                UART_DEBUG_PutString("[SCAN] attr,dt_ms,TX,RX -- any key=next batch\r\n");
            }
            else if (ch=='j'||ch=='J') {
                joystick_active = !joystick_active;
                if (joystick_active) { diag_active=TRUE; abs_preset_active=FALSE; }
                UART_DEBUG_PutString(joystick_active
                    ? "[CLI] Joystick ON\r\n" : "[CLI] Joystick OFF\r\n");
            }
            else if (ch=='l'||ch=='L') {
                if      (ctrl_mode==HAMFLY_DEFER)    ctrl_mode=HAMFLY_RATE;
                else if (ctrl_mode==HAMFLY_RATE)     ctrl_mode=HAMFLY_ABSOLUTE;
                else                                  ctrl_mode=HAMFLY_DEFER;
                abs_preset_active = FALSE;
                sprintf(tx,"[CLI] Mode: %s\r\n",mode_str(ctrl_mode));
                UART_DEBUG_PutString(tx);
            }
            else if (ch=='k'||ch=='K') {
                abs_preset_active = FALSE;
                do_kill(&app_mode, &joystick_active,
                        &streaming_adc, &ctrl_mode);
            }
            else if (ch=='x'||ch=='X') {
                abs_preset_active = FALSE;
                do_kill(&app_mode, &joystick_active,
                        &streaming_adc, &ctrl_mode);
                diag_active = FALSE;
                UART_DEBUG_PutString("[CLI] Quiet. m or j to resume.\r\n");
            }
            else if (ch=='s'||ch=='S') {
                streaming_adc = !streaming_adc;
                UART_DEBUG_PutString(streaming_adc
                    ? "[CLI] ADC stream ON\r\n":"[CLI] ADC stream OFF\r\n");
            }
            else if (ch=='c'||ch=='C') {
                joystick_on_key('c');
            }

            /* CONTROL-only keys */
            if (app_mode == APP_MODE_CONTROL) {
                if (ch=='f'||ch=='F') {
                    hamfly_request_attr(&g_movi, 48u);
                    g_movi.pending_sent_ms = g_tick_ms;
                    ctrl_attr_pending = 48u;
                    UART_DEBUG_PutString("[CTRL] Attr 48 requested\r\n");
                }
                else if (ch=='p'||ch=='P') {
                    show_platform_yaw = !show_platform_yaw;
                    UART_DEBUG_PutString(show_platform_yaw
                        ? "[CTRL] Platform yaw ON\r\n"
                        : "[CTRL] Platform yaw OFF\r\n");
                }
                else if (ch>='0' && ch<='5') {
                    if (ctrl_mode != HAMFLY_ABSOLUTE) {
                        UART_DEBUG_PutString("[CTRL] Need ABS mode (l)\r\n");
                    } else {
                        switch (ch) {
                            case '0':
                                abs_pan_target=0.0f; abs_tilt_target=0.0f;
                                UART_DEBUG_PutString("[CTRL] HOME\r\n"); break;
                            case '1':
                                abs_pan_target=DEG_TO_UNIT(45.0f);
                                abs_tilt_target=0.0f;
                                UART_DEBUG_PutString("[CTRL] Pan+45\r\n"); break;
                            case '2':
                                abs_pan_target=DEG_TO_UNIT(-45.0f);
                                abs_tilt_target=0.0f;
                                UART_DEBUG_PutString("[CTRL] Pan-45\r\n"); break;
                            case '3':
                                abs_pan_target=0.0f;
                                abs_tilt_target=DEG_TO_UNIT(30.0f);
                                UART_DEBUG_PutString("[CTRL] Tilt+30\r\n"); break;
                            case '4':
                                abs_pan_target=0.0f;
                                abs_tilt_target=DEG_TO_UNIT(-30.0f);
                                UART_DEBUG_PutString("[CTRL] Tilt-30\r\n"); break;
                            case '5':
                                abs_pan_target=DEG_TO_UNIT(90.0f);
                                abs_tilt_target=0.0f;
                                UART_DEBUG_PutString("[CTRL] Pan+90\r\n"); break;
                            default: break;
                        }
                        abs_preset_active = TRUE;
                        joystick_active   = FALSE;
                    }
                }
            }
        }

        /* --- SCAN keys --- */
        else if (app_mode == APP_MODE_SCAN) {
            if (ch != 0u) {
                if (ch=='x'||ch=='X'||ch=='k'||ch=='K') {
                    scan_tx_pending = FALSE; scan_waiting = FALSE;
                    g_movi.pending_attr  = 0u;
                    g_movi.pending_ready = false;
                    app_mode = APP_MODE_STANDBY;
                    UART_DEBUG_PutString("[SCAN] Aborted\r\n");
                } else if (scan_waiting) {
                    scan_waiting = FALSE;
                }
            }
        }

        /* --- TEST keys --- */
        else if (app_mode == APP_MODE_TEST) {
            if (ch=='t'||ch=='T') {
                g_movi.pending_attr  = 0u;
                g_movi.pending_ready = false;
                app_mode = APP_MODE_STANDBY;
                UART_DEBUG_PutString("[TEST] -> STANDBY\r\n");
            }
            else if (ch=='k'||ch=='K'||ch=='x'||ch=='X') {
                g_movi.pending_attr  = 0u;
                g_movi.pending_ready = false;
                do_kill(&app_mode,&joystick_active,&streaming_adc,&ctrl_mode);
            }
            else {
                uint16_t req = 0u;
                if      (ch=='a'||ch=='A') { req=22u; UART_DEBUG_PutString("[TEST] attr 22\r\n"); }
                else if (ch=='g'||ch=='G') { req=4u;  UART_DEBUG_PutString("[TEST] attr 4\r\n"); }
                else if (ch=='b'||ch=='B') { req=3u;  UART_DEBUG_PutString("[TEST] attr 3\r\n"); }
                else if (ch=='s'||ch=='S') { req=1u;  UART_DEBUG_PutString("[TEST] attr 1\r\n"); }
                else if (ch=='n'||ch=='N') { req=12u; UART_DEBUG_PutString("[TEST] attr 12\r\n");}
                else if (ch=='2')          { req=2u;  UART_DEBUG_PutString("[TEST] attr 2\r\n"); }
                else if (ch=='4')          { req=48u; UART_DEBUG_PutString("[TEST] attr 48\r\n");}
                else if (ch=='q'||ch=='Q') { print_quat_crosscheck(); }
                if (req != 0u && g_movi.pending_attr == 0u) {
                    hamfly_request_attr(&g_movi, req);
                    g_movi.pending_sent_ms = g_tick_ms;
                }
            }
        }

        /* --- RESET keys --- */
        else if (app_mode == APP_MODE_RESET) {
            if (ch=='x'||ch=='X'||ch=='k'||ch=='K') {
                g_movi.pending_attr  = 0u;
                g_movi.pending_ready = false;
                reset_state = RESET_IDLE;
                app_mode    = APP_MODE_STANDBY;
                UART_DEBUG_PutString("[RESET] Aborted\r\n");
            }
        }

        /* --- SENSOR keys --- */
        else if (app_mode == APP_MODE_SENSOR) {
            if (ch != 0u) {
                g_movi.pending_attr  = 0u;
                g_movi.pending_ready = false;
                sensor_tx_pending = FALSE;
                app_mode = APP_MODE_STANDBY;
                UART_DEBUG_PutString("[SENSOR] -> STANDBY\r\n");
            }
        }

        /* Calibration prompt */
        joy_cal_state_t cal_now = joystick_cal_state();
        cal_prompt(cal_prev, cal_now);
        cal_prev = cal_now;

        /* ----------------------------------------------------------------
         * Pump RX
         * ---------------------------------------------------------------- */
        hamfly_pump(&g_movi);

        /* ----------------------------------------------------------------
         * TEST: response or timeout
         * ---------------------------------------------------------------- */
        if (app_mode == APP_MODE_TEST) {
            if (g_movi.pending_ready) {
                uint32_t dt = g_tick_ms - g_movi.pending_sent_ms;
                print_test_response(dt);
                g_movi.pending_ready = false;
                g_movi.pending_attr  = 0u;
            }
            else if (g_movi.pending_attr != 0u &&
                     (g_tick_ms - g_movi.pending_sent_ms) >= TEST_TIMEOUT_MS) {
                sprintf(tx,"[TEST] TIMEOUT attr=%u\r\n",
                        (unsigned)g_movi.pending_attr);
                UART_DEBUG_PutString(tx);
                g_movi.pending_attr = 0u;
            }
        }

        /* ----------------------------------------------------------------
         * SCAN
         * ---------------------------------------------------------------- */
        if (app_mode == APP_MODE_SCAN) {
            if (!scan_waiting) {
                if (scan_tx_pending && g_movi.pending_ready) {
                    uint32_t dt = g_tick_ms - scan_sent_ms;
                    char *bp = tx;
                    bp += sprintf(bp, "%u,%lu,",
                            (unsigned)g_movi.pending_response_attr,
                            (unsigned long)dt);
                    for (i=0u; i<scan_tx_len; i++)
                        bp += sprintf(bp,"%02X",(unsigned)scan_tx_buf[i]);
                    bp += sprintf(bp,",");
                    for (i=0u; i<g_movi.pending_payload_len; i++)
                        bp += sprintf(bp,"%02X",(unsigned)g_movi.pending_payload[i]);
                    bp += sprintf(bp,"\r\n");
                    UART_DEBUG_PutString(tx);
                    g_movi.pending_ready = false;
                    g_movi.pending_attr  = 0u;
                    scan_tx_pending = FALSE;
                    scan_next_attr++;
                    if (scan_next_attr==scan_batch_start+SCAN_BATCH_SIZE
                        || scan_next_attr>SCAN_ATTR_MAX) {
                        UART_DEBUG_PutString("=========\r\n");
                        if (scan_next_attr > SCAN_ATTR_MAX) {
                            UART_DEBUG_PutString("[SCAN] Complete\r\n");
                            app_mode = APP_MODE_STANDBY;
                        } else {
                            scan_batch_start = scan_next_attr;
                            scan_waiting = TRUE;
                            UART_DEBUG_PutString("[SCAN] any key for next batch\r\n");
                        }
                    }
                }
                else if (scan_tx_pending &&
                         (g_tick_ms-scan_sent_ms) >= SCAN_TIMEOUT_MS) {
                    char *bp = tx;
                    bp += sprintf(bp,"%u,%u,",
                            (unsigned)scan_next_attr,(unsigned)SCAN_TIMEOUT_MS);
                    for (i=0u; i<scan_tx_len; i++)
                        bp += sprintf(bp,"%02X",(unsigned)scan_tx_buf[i]);
                    bp += sprintf(bp,",\r\n");
                    UART_DEBUG_PutString(tx);
                    g_movi.pending_attr = 0u;
                    scan_tx_pending = FALSE;
                    scan_next_attr++;
                    if (scan_next_attr==scan_batch_start+SCAN_BATCH_SIZE
                        || scan_next_attr>SCAN_ATTR_MAX) {
                        UART_DEBUG_PutString("=========\r\n");
                        if (scan_next_attr > SCAN_ATTR_MAX) {
                            UART_DEBUG_PutString("[SCAN] Complete\r\n");
                            app_mode = APP_MODE_STANDBY;
                        } else {
                            scan_batch_start = scan_next_attr;
                            scan_waiting = TRUE;
                            UART_DEBUG_PutString("[SCAN] any key for next batch\r\n");
                        }
                    }
                }
                else if (!scan_tx_pending && scan_next_attr<=SCAN_ATTR_MAX) {
                    scan_tx_len = 0u;
                    hamfly_request_attr_capture(&g_movi, scan_next_attr,
                        scan_tx_buf, SCAN_TX_BUF_SIZE, &scan_tx_len);
                    scan_sent_ms = g_tick_ms;
                    g_movi.pending_sent_ms = g_tick_ms;
                    scan_tx_pending = TRUE;
                }
            }
        }

        /* ----------------------------------------------------------------
         * RESET state machine
         * ---------------------------------------------------------------- */
        if (app_mode == APP_MODE_RESET) {
            if (g_movi.pending_ready &&
                g_movi.pending_response_attr == 382u) {
                uint8_t echo = (g_movi.pending_payload_len > 0u)
                               ? g_movi.pending_payload[0] : 0xFFu;
                g_movi.pending_ready = false;
                g_movi.pending_attr  = 0u;
                if (echo == 0x01u) {
                    reset_saw_01 = TRUE;
                    UART_DEBUG_PutString("[RESET] 0x01 -- resetting...\r\n");
                    reset_state = RESET_ACTIVE;
                } else if (echo==0x00u && reset_saw_01) {
                    UART_DEBUG_PutString("[RESET] COMPLETE -- heading set\r\n");
                    reset_state = RESET_DONE;
                    app_mode    = APP_MODE_STANDBY;
                } else {
                    UART_DEBUG_PutString("[RESET] Waiting for 0x01...\r\n");
                }
            }
            if (reset_state != RESET_DONE &&
                (g_tick_ms-reset_poll_ms) >= RESET_POLL_MS &&
                g_movi.pending_attr == 0u) {
                reset_poll_ms = g_tick_ms;
                hamfly_request_attr(&g_movi, 382u);
                g_movi.pending_sent_ms = g_tick_ms;
            }
            if ((g_tick_ms-reset_start_ms) >= RESET_TIMEOUT_MS) {
                UART_DEBUG_PutString("[RESET] TIMEOUT\r\n");
                g_movi.pending_attr  = 0u;
                g_movi.pending_ready = false;
                reset_state = RESET_IDLE;
                app_mode    = APP_MODE_STANDBY;
            }
        }

        /* ----------------------------------------------------------------
         * SENSOR
         * ---------------------------------------------------------------- */
        if (app_mode == APP_MODE_SENSOR) {
            if (sensor_tx_pending && g_movi.pending_ready) {
                print_sensor_response();
                g_movi.pending_ready = false;
                g_movi.pending_attr  = 0u;
                sensor_tx_pending    = FALSE;
                sensor_idx = (uint8_t)((sensor_idx+1u) % SENSOR_N_ATTRS);
            }
            else if (sensor_tx_pending &&
                     (g_tick_ms-sensor_sent_ms) >= SENSOR_TIMEOUT_MS) {
                sprintf(tx,"[SENSOR] timeout attr=%u\r\n",
                        (unsigned)sensor_attrs[sensor_idx]);
                UART_DEBUG_PutString(tx);
                g_movi.pending_attr = 0u;
                sensor_tx_pending   = FALSE;
                sensor_idx = (uint8_t)((sensor_idx+1u) % SENSOR_N_ATTRS);
            }
            else if (!sensor_tx_pending &&
                     (g_tick_ms-sensor_sent_ms) >= SENSOR_POLL_MS) {
                hamfly_request_attr(&g_movi, sensor_attrs[sensor_idx]);
                g_movi.pending_sent_ms = g_tick_ms;
                sensor_sent_ms = g_tick_ms;
                sensor_tx_pending = TRUE;
            }
        }

        /* ----------------------------------------------------------------
         * CONTROL: on-demand attr reads (f, p keys)
         * ---------------------------------------------------------------- */
        if (app_mode == APP_MODE_CONTROL) {
            if (ctrl_attr_pending != 0u && g_movi.pending_ready &&
                g_movi.pending_response_attr == ctrl_attr_pending) {
                uint32_t dt = g_tick_ms - g_movi.pending_sent_ms;
                print_test_response(dt);
                g_movi.pending_ready = false;
                g_movi.pending_attr  = 0u;
                ctrl_attr_pending    = 0u;
            }
            else if (ctrl_attr_pending != 0u &&
                     (g_tick_ms-g_movi.pending_sent_ms) >= TEST_TIMEOUT_MS) {
                sprintf(tx,"[CTRL] attr %u timeout\r\n",
                        (unsigned)ctrl_attr_pending);
                UART_DEBUG_PutString(tx);
                g_movi.pending_attr = 0u;
                ctrl_attr_pending   = 0u;
            }
        }

        /* ----------------------------------------------------------------
         * Joystick ADC
         * ---------------------------------------------------------------- */
        uint8_t pin = Pin_Sensitivity_Read();
        if (last_button==1u && pin==0u) {
            CyDelay(50);
            if (Pin_Sensitivity_Read()==0u) {
                current_sense=(joy_sensitivity_t)((current_sense+1)%3);
                joystick_set_sensitivity(current_sense);
                UART_DEBUG_PutString("Sensitivity changed\r\n");
                while (Pin_Sensitivity_Read()==0u);
            }
        }
        last_button = pin;

        if (adc_balanced_poll_frame(counts)) {
            joystick_on_sample(counts);
            joystick_get_cmd(&cmd);
            if (streaming_adc) {
                int16_t pm = (int16_t)(cmd.u[CH_X]*1000.0f);
                int16_t tm = (int16_t)(cmd.u[CH_Y]*1000.0f);
                int32_t xmv = adc_balanced_counts_to_mv(counts[CH_X]);
                int32_t ymv = adc_balanced_counts_to_mv(counts[CH_Y]);
                sprintf(tx,"X:%ld mV Y:%ld mV  pan:%d tilt:%d /1000\r\n",
                        (long)xmv,(long)ymv,(int)pm,(int)tm);
                UART_DEBUG_PutString(tx);
            }
            if (joystick_cal_state()==JOY_CAL_CENTER_CAPTURE) {
                uint16_t n = joystick_center_samples_collected();
                if ((n%8u)==0u) {
                    sprintf(tx,"[CAL] %u/%u\r\n",(unsigned)n,
                            (unsigned)CAL_CENTER_SAMPLES);
                    UART_DEBUG_PutString(tx);
                }
            }
        }

        /* ----------------------------------------------------------------
         * Build control
         * ---------------------------------------------------------------- */
        ctl.enable = 1u;
        ctl.kill   = 0u;
        if (abs_preset_active && ctrl_mode==HAMFLY_ABSOLUTE) {
            ctl.pan_mode=HAMFLY_ABSOLUTE; ctl.tilt_mode=HAMFLY_ABSOLUTE;
            ctl.roll_mode=HAMFLY_DEFER;
            ctl.pan=abs_pan_target; ctl.tilt=abs_tilt_target; ctl.roll=0.0f;
        }
        else if (joystick_active && joystick_cal_state()==JOY_CAL_OFF) {
            ctl.pan_mode=ctrl_mode; ctl.tilt_mode=ctrl_mode;
            ctl.roll_mode=HAMFLY_DEFER;
            ctl.pan= cmd.u[CH_X]; ctl.tilt=-cmd.u[CH_Y]; ctl.roll=0.0f;
        }
        else {
            ctl.pan_mode=HAMFLY_DEFER; ctl.tilt_mode=HAMFLY_DEFER;
            ctl.roll_mode=HAMFLY_DEFER;
            ctl.pan=ctl.tilt=ctl.roll=0.0f;
        }

        /* ----------------------------------------------------------------
         * TX at 10 Hz (CONTROL only)
         * ---------------------------------------------------------------- */
        if (app_mode==APP_MODE_CONTROL &&
            joystick_cal_state()==JOY_CAL_OFF &&
            (g_tick_ms-last_tx_ms) >= CONTROL_PERIOD_MS) {
            last_tx_ms = g_tick_ms;
            hamfly_send_control(&g_movi, &ctl);
        }

        /* ----------------------------------------------------------------
         * 1 Hz diagnostic (CONTROL only)
         * ---------------------------------------------------------------- */
        if (diag_active && app_mode==APP_MODE_CONTROL &&
            joystick_cal_state()==JOY_CAL_OFF &&
            (g_tick_ms-last_diag_ms) >= DIAG_PERIOD_MS) {
            last_diag_ms = g_tick_ms;

            uint32_t ms = g_tick_ms;
            sprintf(tx,"  %02lu:%02lu:%02lu\r\n",
                    (unsigned long)(ms/3600000u),
                    (unsigned long)((ms/60000u)%60u),
                    (unsigned long)((ms/1000u)%60u));
            UART_DEBUG_PutString(tx);

            hamfly_statistics_t s;
            hamfly_get_statistics(&g_movi, &s);
            sprintf(tx,"[Serial] TX:%lu RX:%lu csum:%lu err:0x%02X\r\n",
                    (unsigned long)s.tx_packets,
                    (unsigned long)s.rx_packets,
                    (unsigned long)s.rx_bad_checksum,
                    (unsigned)s.uart_err_flags);
            UART_DEBUG_PutString(tx);

