Ham0osh/PSoC-Programs/test_projects/Proj06_freefly_hamflyAPI_integration.cydsn/main.c
            hamfly_telemetry_t st;
            hamfly_get_telemetry(&g_movi, &st);
            if (st.valid) {
                char ps,ts,rs;
                int16_t pi,pf,ti,tf,ri,rf;
                compute_euler(&st,&ps,&pi,&pf,&ts,&ti,&tf,&rs,&ri,&rf);
                int16_t vli=(int16_t)st.battery_left_v;
                int16_t vlf=(int16_t)((st.battery_left_v-(float)vli)*10.0f);
                int16_t vri=(int16_t)st.battery_right_v;
                int16_t vrf=(int16_t)((st.battery_right_v-(float)vri)*10.0f);
                uint8_t imu_err=(st.gimbal_status1>>6)&0x01u;
                uint8_t drv_err=(st.gimbal_status1>>4)&0x01u;
                uint8_t gbl_err=(st.gimbal_status2>>4)&0x01u;
                if (abs_preset_active) {
                    char aps,ats; int16_t api,apf,ati,atf;
                    decomp(abs_pan_target*180.0f,&api,&apf,&aps);
                    decomp(abs_tilt_target*180.0f,&ati,&atf,&ats);
                    sprintf(tx,"[Target] Pan=%c%d.%02d Tilt=%c%d.%02d\r\n",
                            aps,api,apf,ats,ati,atf);
                    UART_DEBUG_PutString(tx);
                }
                sprintf(tx,
                    "[Gimbal] Pan=%c%d.%02d Tilt=%c%d.%02d Roll=%c%d.%02d"
                    " L=%d.%dV R=%d.%dV IMU:%d DRV:%d ERR:%d\r\n",
                    ps,pi,pf, ts,ti,tf, rs,ri,rf,
                    vli,vlf, vri,vrf,
                    imu_err, drv_err, gbl_err);
                UART_DEBUG_PutString(tx);
            } else {
                UART_DEBUG_PutString("[Gimbal] No valid frame\r\n");
            }

            if (show_platform_yaw && ctrl_attr_pending==0u) {
                hamfly_request_attr(&g_movi, 2u);
                g_movi.pending_sent_ms = g_tick_ms;
                ctrl_attr_pending = 2u;
            }

            char lrs,uds; int16_t lri,lrf,udi,udf;
            decomp(cmd.u[CH_X],&lri,&lrf,&lrs);
            decomp(cmd.u[CH_Y],&udi,&udf,&uds);
            sprintf(tx,"[Joy] L/R=%c%d.%02d U/D=%c%d.%02d (%s)\r\n",
                    lrs,lri,lrf, uds,udi,udf, mode_str(ctrl_mode));
            UART_DEBUG_PutString(tx);

            s.uart_err_flags = 0u;
        }
    }
}

/* [] END OF FILE */